Workspace/test_cases/sod_shock_tube-waveTransmition-plInf/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.2 0)
    (0 0.2 0)
    (0 0 0.2)
    (1 0 0.2)
    (1 0.2 0.2)
    (0 0.2 0.2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5000 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftSide
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    rightSide
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    emptywalls
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (5 6 7 4)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

