Workspace/test_cases/sod_shock_tube-waveTransmition-plInf/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|e|h).*"
    {
/*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.0;		//0.001	
	minIter 	2;
    }

    "rho.*"
    {

        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;


	//solver          diagonal;
    }
}

PIMPLE
{
    transonic yes;			//Enable to have the same behaviour as in sonicFoam (OF6 and below)
    consistent yes;

    nOuterCorrectors     3;		//1 - 3 - 2
    nCorrectors          1;		//1 - 1 - 2
    nNonOrthogonalCorrectors 1;		//0 - 1 - 1
}



relaxationFactors
{
    fields
    {
        ".*"   1;  // set 1 to ensure diagonal equality
    }
    equations
    {
        ".*"   1;  // set 1 to ensure diagonal equality
    }
}


// ************************************************************************* //
